In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

# Connecting to MySQL Server

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

In [3]:
pw = '11213141'
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

# Creating a New Database

In [4]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [5]:
creat_db_query = "CREATE DATABASE mydb";
create_database(connection, creat_db_query);

Error: '1007 (HY000): Can't create database 'mydb'; database exists'

# Connecting to the Database

In [6]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

# Creating a Query Execution Function

In [7]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

# Creating Tables

In [8]:
create_person_table = """
CREATE TABLE Person (
  person_id INT PRIMARY KEY,
  name VARCHAR(100) NOT NULL,
  address VARCHAR(100) NOT NULL,
  phone VARCHAR(100) NOT NULL
  );
 """
connection = create_db_connection("localhost", "root", pw, 'mydb'); # Connect to the Database
execute_query(connection, create_person_table); # Execute our defined query

MySQL Database connection successful
Query successful

# Add some data

In [9]:
person_insert_query = """
INSERT INTO Person VALUES
(1, 'Bruce Schneier', '12345', '795 E DRAGRAM Drive, TUCSON, AZ 85705-7598'),
(2, 'Schneier, Bruce', '(703)111-2121', '795 E DRAGRAM Dr., TUCSON, AZ 85705'), 
(3, 'Schneier, Bruce Wayne', '123-1234', '770W DRAGRAM Drive # 321, TUCSON, AZ 85703');
"""

connection = create_db_connection("localhost", "root", pw, 'mydb')
execute_query(connection, person_insert_query)

MySQL Database connection successful
Query successful

# Reading Data

In [11]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [12]:
list_query = """
SELECT * FROM Person;
"""
connection = create_db_connection("localhost", "root", pw, 'mydb')
results = read_query(connection, list_query)
for result in results:
  print(result)

MySQL Database connection successful
(1, 'Bruce Schneier', '12345', '795 E DRAGRAM Drive, TUCSON, AZ 85705-7598')
(2, 'Schneier, Bruce', '(703)111-2121', '795 E DRAGRAM Dr., TUCSON, AZ 85705')
(3, 'Schneier, Bruce Wayne', '123-1234', '770W DRAGRAM Drive # 321, TUCSON, AZ 85703')

# Formatting Output into a pandas DataFrame

In [14]:
from_db = []

for result in results:
  result = list(result)
  from_db.append(result)


columns = ["id", "name", "phone", "address"]
df = pd.DataFrame(from_db, columns=columns)
df

,id,name,phone,address
0,1,Bruce Schneier,12345,"795 E DRAGRAM Drive, TUCSON, AZ 85705-7598"
1,2,"Schneier, Bruce",(703)111-2121,"795 E DRAGRAM Dr., TUCSON, AZ 85705"
2,3,"Schneier, Bruce Wayne",123-1234,"770W DRAGRAM Drive # 321, TUCSON, AZ 85703"

# Updating Records

In [ ]:
update = """
UPDATE Person 
SET address = '23 Fingiertweg, 14534 Berlin' 
WHERE person_id = 1;
"""

connection = create_db_connection("localhost", "root", pw, 'mydb')
execute_query(connection, update)
df

# Deleting Records

In [ ]:
delete_query = """
DELETE FROM Person 
WHERE person_id = 2;
"""

connection = create_db_connection("localhost", "root", pw, 'mydb')
execute_query(connection, delete_query)
df

In [15]:
# drop_query = """
# DROP TABLE Person;
# """
# connection = create_db_connection("localhost", "root", pw, 'mydb')
# execute_query(connection, drop_query)

# References
[1] https://www.freecodecamp.org/news/connect-python-with-sql/